# 외곽선 (컨투어)

import cv2
import numpy as np
img = np.zeros((500, 500), dtype=np.uint8)

cv2.rectangle(img, (100, 100), (200, 200), (255, 255, 255), -1) #사각
cv2.circle(img, (250, 250), 50, (255, 255, 255), -1) #원
pts = np.array([[300, 300], [350, 350], [300, 350]], np.int32)
cv2.fillPoly(img, [pts], (255, 255, 255)) # 삼각
cv2.circle(img, (400, 100), 5, (255, 255, 255), -1) #잡티
concave_pts = np.array([
    [40, 320],   # 좌측 상단
    [100, 320],  # 우측 상단
    [100, 440],  # 우측 하단
    [40, 440],   # 좌측 하단
    [70, 380]    # 파인곳
], np.int32)
cv2.fillPoly(img, [concave_pts], 255)

# contours(tuple), hierarchy(numpy)
contours, hierarchy = cv2.findContours(
    img,
    cv2.RETR_EXTERNAL,
    cv2.CHAIN_APPROX_SIMPLE
) # 끝지점만 찾음.

# contour = 인덱스 1,2,3,4 로 확인하면 각각 도형이 꼭지점, 위치를 알 수 있음
# cv2.drawContours(img, contours, -1,(100, 255, 100), 5) # -1 컨투어 인덱스는 전체 다
#이미지, 컨투어즈 중 인덱스 위치에 무슨색깔로 선두께를 만큼.


# 컨투어 분석 (종류별 설명 부탁해)
# 컨투어 = contours[1]
# 컨투어 = contours[0]
컨투어 = contours[2] #circle

# 면적 = cv2.contourArea(컨투어)
# print(면적) #1250.0

둘레 = cv2.arcLength(컨투어, True)  #closed 역할 ?
# print(둘레) #170.7

# 바운딩박스 = cv2.boundingRect(컨투어)
# print(바운딩박스) #(300, 300, 51, 51) x,y,w,h

# 회전된사각형 = cv2.minAreaRect(컨투어)
# print(회전된사각형) # ((312.5000305175781, 337.5000305175781), (35.35533905029297, 70.71067810058594), -45.0) 면적area를 최소한으로(바운드박스)를 만들어서, 회전(시계방향, 음수는 반시계)

# 다각형근사 = cv2.approxPolyDP(컨투어, 15, True) #컨투어, eps = 15, closed = True
# print(다각형근사)
'''
[[[250 200]]

 [[200 250]]

 [[250 300]]

 [[300 250]]]
'''
# 다각형근사_둘레 = cv2.approxPolyDP(컨투어, 둘레*0.02, True) #컨투어, eps = 15, closed = True
# print(다각형근사_둘레) #팔각형
'''
[[[250 200]]

 [[220 210]]

 [[200 250]]

 [[210 280]]

 [[250 300]]

 [[280 290]]

 [[300 250]]

 [[290 220]]]

'''

# 볼록껍질 = cv2.convexHull(컨투어) # concave_pts 꼭지점 위치 나옴. 볼록한 부분만 나옴. 파인곳은 제외
# print(볼록껍질)
# '''
# [[[100 320]]
#
#  [[100 440]]
#
#  [[ 40 440]]
#
#  [[ 40 320]]]
# '''

# 무게중심 = cv2.moments(컨투어)
# print(무게중심) #삼각형의 무게중심점, 아래 값에 대한 해석이 필요해
# {'m00': 1250.0, 'm10': 395833.3333333333, 'm01': 416666.6666666666, 'm20': 125520833.33333333, 'm11': 132031250.0, 'm02': 139062500.0, 'm30': 39859375000.0, 'm21': 41895833333.333336, 'm12': 44093750000.0, 'm03': 46468750000.0, 'mu20': 173611.1111111045, 'mu11': 86805.55555556715, 'mu02': 173611.1111111343, 'mu30': 1157407.407409668, 'mu21': 578703.7037056312, 'mu12': -578703.703711614, 'mu03': -1157407.4074172974, 'nu20': 0.11111111111110687, 'nu11': 0.05555555555556298, 'nu02': 0.11111111111112595, 'nu30': 0.020951312035197886, 'nu21': 0.010475656017613372, 'nu12': -0.010475656017721673, 'nu03': -0.02095131203533599}


# 회전된사각형 그리기
sv2.drawContours()

# cv2.imshow('img', img)
# cv2.waitKey(0)
# cv2.destroyAllWindows()

# a = np.array([[10,10,200], [10,10,200], [10,10,200]])
# b = np.array([[-1,0,1], [-2,0,2], [-1,0,1]])
# print(a*b.sum())
#행열곱이 아니라 행렬합성곱 연산법으로 적용됨.
#원본 픽셀과 행렬합성곱에 픽셀 배열이 다름. 때문에 자동으로 조정해서(보관법? 보강법?) 결론 도출